HW4/SOAP.txt

PHP program to access a web service using HTML form parameters.

Shakespeare Web Service Response from a PHP Client

PHP Array Response

Array ( [GetSpeechResult] => JULIUS CAESARCAESARLet me have men about me that are fat; Sleek-headed men and such as sleep o' nights: Yond Cassius has a lean and hungry look; He thinks too much: such men are dangerous. )
Request

POST /WSShakespeare.asmx HTTP/1.0
Host: www.xmlme.com
User-Agent: NuSOAP/0.7.3 (1.114)
Content-Type: text/xml; charset=ISO-8859-1
SOAPAction: "http://xmlme.com/WebServices/GetSpeech"
Content-Length: 490

<?xml version="1.0" encoding="ISO-8859-1"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://xmlme.com/WebServices"><SOAP-ENV:Body><GetSpeech xmlns="http://xmlme.com/WebServices"><Request> Yond Cassius has a lean and hungry look</Request></GetSpeech></SOAP-ENV:Body></SOAP-ENV:Envelope>
Response

HTTP/1.1 200 OK
Connection: close
Date: Fri, 22 Feb 2013 23:25:32 GMT
Server: Microsoft-IIS/6.0
X-Powered-By: ASP.NET
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 630

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetSpeechResponse xmlns="http://xmlme.com/WebServices"><GetSpeechResult>&lt;SPEECH&gt;&lt;PLAY&gt;JULIUS CAESAR&lt;/PLAY&gt;&lt;SPEAKER&gt;CAESAR&lt;/SPEAKER&gt;Let me have men about me that are fat; Sleek-headed men and such as sleep o' nights: Yond Cassius has a lean and hungry look; He thinks too much: such men are dangerous.&lt;/SPEECH&gt;</GetSpeechResult></GetSpeechResponse></soap:Body></soap:Envelope>